/* 
  Localizable.strings
  JYAuthorizationBundle

  Created by dqh on 2019/3/12.
  Copyright © 2019 dqh. All rights reserved.
*/

"ok" = "OK";
"go" = "Go";

// 定位
"location.description" = "Location Verify Error";
"location.notdetermind" = "The user has not yet made a choice regarding whether this app can use location service";
"location.restricted" = "This application is not authorized to access the service. The user cannot change this app’s status, possibly due to active restrictions such as parental controls being in place.";
"location.unserviced" = "location services are enabled on the device.";

"location.always.denied" = "The user explicitly denied the use of location services for this app or location services are currently disabled in Settings.";
"location.wheninuse.denied" = "The user explicitly denied the use of location services for this app or location services are currently disabled in Settings.";
"location.always.wheninuse" = "The user can always use the location service,if you just use it when app in use,go and change it";
"location.wheninuse.always" = "The user can use the location service when app is use, if you just want always use the service,go and change it";

// 通讯录
"addressbook.description" = "AddressBook Verify Error";
"addressbook.notdetermind" = "The user has not yet made a choice regarding whether this app can use addressBook service";
"addressbook.restricted" = "his application is not authorized to access the service. The user cannot change this app’s status, possibly due to active restrictions such as parental controls being in place.";
"addressbook.denied" = "The user explicitly denied access to use addressbook service for this app";

// 日历
"calendar.description" = "Calendar Verify Error";
"calendar.notdetermind" = "The user has not yet made a choice regarding whether this app can use calendar service";
"calendar.restricted" = "his application is not authorized to access the service. The user cannot change this app’s status, possibly due to active restrictions such as parental controls being in place.";
"calendar.denied" = "The user explicitly denied access to use calendar service for this app";

// 提醒
"reminder.description" = "Reminder Verify Error";
"reminder.notdetermind" = "The user has not yet made a choice regarding whether this app can use reminder service";
"reminder.restricted" = "his application is not authorized to access the service. The user cannot change this app’s status, possibly due to active restrictions such as parental controls being in place.";
"reminder.denied" = "The user explicitly denied access to use reminder service for this app";

// 相册
"photo.description" = "PhotoLibrary Verify Error";
"photo.notdetermind" = "The user has not yet made a choice regarding whether this app can use photoLibrary service";
"photo.restricted" = "his application is not authorized to access the service. The user cannot change this app’s status, possibly due to active restrictions such as parental controls being in place.";
"photo.denied" = "The user explicitly denied access to use photolibrary service for this app";

// 麦克风
"microphone.description" = "MicroPhone Verify Error";
"microphone.notdetermind" = "The user has not yet made a choice regarding whether this app can use microPhone service";
"microphone.restricted" = "his application is not authorized to access the service. The user cannot change this app’s status, possibly due to active restrictions such as parental controls being in place.";
"microphone.denied" = "The user explicitly denied access to use microphone service for this app";

// 相机
"camera.description" = "Camera Verify Error";
"camera.notdetermind" = "The user has not yet made a choice regarding whether this app can use camera service";
"camera.restricted" = "his application is not authorized to access the service. The user cannot change this app’s status, possibly due to active restrictions such as parental controls being in place.";
"camera.denied" = "The user explicitly denied access to use camera service for this app";


// 语音识别
"speechrecognition.description" = "SpeechRecognition Verify Error";
"speechrecognition.notdetermind" = "The user has not yet made a choice regarding whether this app can use speechRecognition service";
"speechrecognition.restricted" = "his application is not authorized to access the service. The user cannot change this app’s status, possibly due to active restrictions such as parental controls being in place.";
"speechrecognition.denied" = "The user explicitly denied access to use speechrecognition service for this app";
"speechrecognition.lowversion" = "This servie only available in iOS 10.0 or higher version";

// 健康
"health.description" = "Health Verify Error";
"health.notdetermind" = "The user has not yet made a choice regarding whether this app can use heanth service";
"health.restricted" = "his application is not authorized to access the service. The user cannot change this app’s status, possibly due to active restrictions such as parental controls being in place.";
"health.denied" = "The user explicitly denied access to use health service for this app";
"health.unserviced" = "health services are enabled on the device.";
